export const data = [
    {
        name: "더하기",
        icon: "+",
        definition: "두 수를 더한다",
        history: "더하기는 수학자 디오판토스가 최초로 사용했다. 더하기의 기호 +는 '그리고'라는 뜻의 라틴어 'et'을 흘려 쓰는데에서 생겨났다. 1557년에 로버트 레코드가 +를 영국에 소개하면서 널리 쓰이게 되었다."
    },
    {
        name: "빼기",
        icon: "-",
        definition: "두 수를 뺀다",
        history: "빼기를 나타내는 -는 '모자라다'라는 뜻을 지난 라틴어 단어 'minus'에서 탄생했다. 시간이 지나면서 단어가 줄여지자 -만 남게 되었다."
    },
    {
        name: "곱하기",
        icon: "×",
        definition: "두 수를 곱한다",
        history: "× 기호는 꽤 늦게 등장했다. 영국의 수학자 윌리엄 오트레드가 1618년에 × 기호를 처음 쓴 것으로 언급된다."
    },
    {
        name: "나누기",
        icon: "÷",
        definition: "두 수를 나눈다",
        history: "스위스의 수학자 란(Rahn)이 1659년 취리히에서 발행한 대수학책에서 나누기 기호를 처음 사용했다."
    },
    {
        name: "허수",
        icon: "i",
        definition: "실수가 아닌 복소수",
        history: "고대 그리스의 수학자 헤론은 거듭제곱하여 음수가 되는 수에 대한 개념을 기록한 바 있다. 1572년 이탈리아의 수학자 라파엘 봄벨리가 허수 단위를 정의하였다. 이후 르네 데카르트가 《방법서설》의 부록 〈기하〉(프랑스어: La Géométrie)에서 상상의 수라고 부른 데에서 허수라는 이름이 정착되었다. 허수라는 이름은 레온하르트 오일러와 카를 프리드리히 가우스에 의해 널리 알려졌으며, 오일러는 허수 단위 기호로 i 를 도입하였다. 또한 오일러는 이것을 방정식 x^3+y^3=z^3일때 이 방정식을 만족하는 정수해는 없다는 것을 증명할 때 사용하였다. 1799년 카스파르 베셀이 복소수의 기하학적 표현을 완성하였다."
    },
    {
        name: "소수",
        icon: "",
        definition: "약수가 1과 자신의 2개인 1보타 큰 자연수",
        history: "프랑스의 아마추어 수학자 피에르 드 페르마에 의해 많이 연구되었다. 페르마의 소정리인 '소수 p와 p로 나눠지지 않는 자연수 a가 있을 때, (a^-1)/p의 나머지 = 1'이 실생활에서 아주 유용하다."
    },
    {
        name: "부등호",
        icon: ">,<",
        definition: "두 수의 크기를 비교한다",
        history: "영국의 수학자 헤리오트가 죽은지 10년 후(1631년)에 발행된 그의 책에서 발견된다. 또한 부등호는 그로부터 1세기가 지난 후에 피에르 부케에 의해서 사용되었다."
    },
    {
        name: "원주율",
        icon: "π",
        definition: "원둘레와 지름의 비",
        history: "π의 값을 기원전 2000년 바빌로니아 인들은 3.125, 고대 이집트인들은 3.16으로 사용하였다. 한편, 아르키메데스는 원에 내접 및 외접하는 정 96각형 둘레의 범위를 구하여 원주율이 3.140보다는 크고 3.142보다는 작은 수임을 알게 되었다. 독일의 루돌프는 π의 값을 소수점 아래 35자리까지 구하는데 일생을 바쳤으며, 독일에서는 원주율을 '루돌프의 수'라고 부르기도 한다. π가 원주율을 나타내는 기호로 처음 사용된 것은 1706년 영국의 수학자 존스의 책에서이고, 1737년 스위스의 수학자 오일러가 π를 사용하면서부터 원주율을 나타내는 표준기호가 되었다. 1873년 영국의 샹크스는 소수점 아래 707자리까지 π값을 구하였으나 안타깝게도 소수 527자리까지만 계산이 옳았다고 한다."
    },
    {
        name: "함수기호",
        icon: "f(x)",
        definition: "-",
        history: "함수라는 낱말을 처음으로 수학에서 쓰기 시작한 사람은 라이프니츠였다. 그러나 함수에 f(x)라는 기호를 쓴 것은 오일러가 처음이었다고 한다."
    },
    {
        name: "오일러의 수",
        icon: "e",
        definition: "Σ0-∞(1/n!)",
        history: "자연로그의 밑이 되는 자연상수 e를 오일러의 수라고 하며 e=2.71828....의 값을 가지는 무리수이다."
    },
    {
        name: "세타",
        icon: "θ",
        definition: "모르는 각도를 나타낸다.",
        history: "-"
    },  
    {
        name: "시그마",
        icon: "Σ",
        definition: "연속수를 더한다.",
        history: "Σ는 합을 뜻하는 sum의 첫 글자인 s를 의미하는 그리스 문자로 첫 항부터 n항까지의 합을 표현하는 간단한 방법이다."
    },
    {
        name: "제곱근",
        icon: "√",
        definition: "제곱하면 a가 되는 수를 a의 제곱근이라고 함.",
        history: "1480년경 점을 찍어서 제곱근을 나타내었고 1524년 지금과 비슷하지만 음표처럼 생긴 기호를 사용했다. 기호 √은 1525년에 수학자 루돌프가 처음 사용했다."
    }
]